app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => bcrypt($data['password']),
            'status' => 1
        ]);
        $user
            ->roles()
            ->attach(Role::where('name', 'student')->first());
---
insert into `role_user` (`role_id`, `user_id`) values (3, 4)
select * from `roles` where `name` = 'student' limit 1

    protected function createTutor(array $data)
    {
        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => bcrypt($data['password']),
            'status' => 2
        ]);
        $user
            ->roles()
            ->attach(Role::where('name', 'tutor')->first());
        $user
            ->convocatories()
            ->attach(Convocatory::where('id', $data['convocatory_id'])->first());
---
insert into `role_user` (`role_id`, `user_id`) values (2, 3)
select * from `roles` where `name` = 'tutor' limit 1
select * from `convocatories` where `id` = '1' limit 1