app/Convocatory.php

select * from `convocatories` where `end` > '2019-05-06' limit 1
---
    public static function showActive()
    {
        $now = Carbon::now()->format('Y-m-d');
        $checkConvocatory = Convocatory::where('end', ">", $now)->first();