app/Http/Controllers/ConvocatoryController.php

    public function index(Request $request)
    {
        $request->user()->authorizeRoles(['admin']);
        $convocatories = Convocatory::orderBy('start', "DESC")->paginate(10);
---
select * from `convocatories` order by `start` desc

    public function store(Request $request)
    {
        $request->user()->authorizeRoles(['admin']);
        $convocatory = new Convocatory();
        $this->validator($request->all())->validate();
        $checkConvocatory = Convocatory::where('end', ">", $request->start)->first();;
        if($checkConvocatory)
        {
            return back()->with('Error', 'There is already a call');
        }
        else
        {
            $convocatory->user_id =  $request->user()->id;
            $convocatory->start = $request->start;
            $convocatory->end = $request->end;
            $convocatory->written = $request->written;
            $convocatory->save();
---
select * from `convocatories` where `end` > '2019-05-05' limit 1
insert into `convocatories` (`user_id`, `start`, `end`, `written`, `updated_at`, `created_at`) values (1, '2019-05-05', '2019-10-19', '3grfdc3qewfffffffffffffffffffffffffffffff', '2019-05-06 01:08:17', '2019-05-06 01:08:17')

    public function tutorSelected(Request $request)
    {
        $request->user()->authorizeRoles(['admin']);
        $this->validatorSelection($request->all())->validate();
        $tutor = User::find($request->id);
        $tutor->status = $request->flag;
        Mail::to($tutor->email)->send(new SendTutorRequestEmail($tutor));
        if($request->flag == 1){
            $tutor->email_verified_at = Carbon::now();
            $tutor->save();
---
update `users` set `email_verified_at` = '2019-05-06 01:08:54', `status` = '1', `updated_at` = '2019-05-06 01:08:54' where `id` = 3