app/Http/Controllers/DivisionController.php

select * from `modules` where `modules`.`division_id` = 1 and `modules`.`division_id` is not null
---
    public function index()
    {
        $divisions = Division::with(['modules'])->paginate(10);