app/Http/Controllers/ModuleController.php

    public function index()
    {
        $modules = Module::with(['division', 'users'])->paginate(10);
---
select * from `divisions` where `divisions`.`id` in (1)
select * from `modules`

    public function store(Request $request)
    {
        $request->user()->authorizeRoles(['admin']);
        $this->validatorStore($request->all())->validate();
        $module = new Module($request->all());
        $module->save();
---
insert into `modules` (`name`, `division_id`, `updated_at`, `created_at`) values ('Ecuaciones diferenciales', '1', '2019-05-06 00:52:37', '2019-05-06 00:52:37')