app/Http/Controllers/PostController.php

    public function store(Request $request)
    {
        $this->authorize('subscribe', $post->module);
        $request->user()->authorizeRoles(['tutor']);
        $this->validatorStore($request->all())->validate();
        $post = new Post($request->all());
        $post->save();
        foreach ($request->file('files') as $file) {
            if ($file->isValid()) {
                $hashedName = $file->store($post->module->division->description.'/'.$post->module->name.'/'.$post->id.'/');
                $addFile = File::create([
                    'foreign_id' => $post->id,
                    'foreign_type' => 'App\\Post',
                    'name' => $file->getClientOriginalName(),
                    'hashed' => $hashedName,
                    'mime' => $file->getClientMimeType(),
                    'size' => $file->getClientSize(),
                ]);
                $addFile->save();
            }
        }
        $module = Module::find($request->module_id);
        $module->load(['users', 'files', 'posts']);
---
select * from `posts`
insert into `posts` (`user_id`, `name`, `description`, `updated_at`, `created_at`) values ('3', 'dos', 'tres', '2019-05-06 23:50:01', '2019-05-06 23:50:01')