app/Http/Controllers/ProfileController.php

select * from `careers`
---
    public function edit(Profile $profile)
    {
        $careers = Career::all();

select * from `careers`
---
    public function show(Profile $profile)
    {
        $profile->load(['user', 'career']);

update `users` set `avatar` = 'public/avatars/2.png', `updated_at` = '2019-05-06 00:51:59' where `id` = 2
---
    public function store(Request $request)
    {
        $user = User::find($request->user_id);
        $this->validatorProfile($request->all())->validate();
        if(isset($request->avatar)){
            $user->uploadImage(request()->file('avatar'), 'avatar');
            $user->save();