app/Providers/AppServiceProvider.php

select * from `divisions`
---
    public function boot()
    {
        Schema::defaultStringLength(191);
        view()->composer('auth.register', function($view) {
            $view->with('convocatory', Convocatory::showActive());
        });

        view()->composer('auth.login', function($view) {
            $view->with('convocatory', Convocatory::showActive());
        });

        view()->composer('home', function($view) {
            $view->with('divisions', Division::with(['modules'])->get());